{
  "text": "<div><h3>INTERIOR ARCHITECTURE AND FURNITURE DESIGN - GRADUATION EXPO 2018</h3><p>Venue: Interior Architecture and Furniture Department</p><p>Location: Royal Academy of Art, The Hague, Prinsessegracht 4, 2514 AN Den Haag</p><p>Dates: 6th - 12th July, 2018</p><br><p>Long live the new flesh</p><p>The \"Long live the new flesh\" collective merges the new with the old. Translates the past and the contemporary into the future. A new generation synthesized and incoming, proposing you the new flesh of our ideas. Ready to act as the fresh voice of today and tomorrow.</p><br><p>The collective consists of the graduating students from the Interior Architecture &amp; Furniture Design Department of the Royal Academy of Art. From the 6th until the 12th of July 2018 we will be exhibiting our graduation projects in a graduation expo also including related short lectures, guided tours and a reading room featuring the graduation papers. </p><br><p>In this final year, the students pursue their own areas of interest that include a wide range of topics and are categorized in four different themes: Spatial narratives session, System - observations &amp; understanding session,  Material narratives session, Workings &amp; mechanisms session.</p><br><p>It is impossible to realise this graduation expo without your generous support. We need materials for the exhibition itself, the context for showing our projects. We produce a magazine and organize events connected to the exhibition. Donate and invest in our future.</p><br><br><p>GRADUATES:</p><p>Rachel Borovska, Yamile Bueters, Kornelija Chaleckyte, Aref Dashti, Charlotte de Goey, Juliette Groenendaal, Anastasia Izotova, Ashton Kang, Christiaan van der Klooster, Hyun Woo Koo, Dann Kuiper, Eunice TW Ma, Konstantin Maksimov, Charlotte Meijerink, Petra Popangelova, Sarah Anne Rootert, Bagdat Sert, Edward Slaviero, Maarten Slof, Fabienne van Steensel, Manon Stoeltie, Luuk Wezenberg, Arjen Witteveen, Zhengda Ye, Yi Zhang</p><br><p>SOCIAL MEDIA </p><p>PUBLICITEIT, CONTACT &amp; INFO</p><p><a href=\"mailto:graduationexpo@gmail.com\">graduationexpo@gmail.com</a></p></div>"
}
